
Функция ДанныеМетаданных() Экспорт

	данные = Новый Соответствие;
	
	СтруктВставить( данные, "AccumulationRegisters", "РегистрыНакопления", "Регистр накомления" );
	СтруктВставить( данные, "BusinessProcesses", "БизнесПроцессы", "Бизнес процесс" );
	СтруктВставить( данные, "Catalogs", "Справочники", "Справочник" );
	СтруктВставить( данные, "ChartsOfCharacteristicTypes", "ПланыВидовХарактеристик", "План видов характеристик" );
	СтруктВставить( данные, "CommonCommands", "Общие.ОбщиеКоманды", "Общая команда" );
	СтруктВставить( данные, "CommonForms", "Общие.ОбщиеФормы", "Общая управляемая форма" );
	СтруктВставить( данные, "CommonModules", "Общие.ОбщиеМодули", "Общий модуль" );
	СтруктВставить( данные, "CommonTemplates", "Общие.ОбщиеМакеты", "Общий макет" );
	СтруктВставить( данные, "Constants", "Константы", "Константа" );
	СтруктВставить( данные, "DataProcessors", "Обработки", "Обработка" );
	СтруктВставить( данные, "DocumentJournals", "ЖурналыДокументов", "ЖурналДокументов" );
	СтруктВставить( данные, "Documents", "Документы", "Документ" );
	СтруктВставить( данные, "Enums", "Перечисления", "Перечисление" );
	СтруктВставить( данные, "InformationRegisters", "РегистрыСведений", "Регистр сведений" );
	СтруктВставить( данные, "Reports", "Отчеты", "Отчет" );
	СтруктВставить( данные, "Roles", "Общие.Роли", "Роль" );
	СтруктВставить( данные, "ScheduledJobs", "РегламентныеЗадания", "Регламентное задание" );
	СтруктВставить( данные, "Tasks", "Задачи", "Задача" );

	Возврат данные;

КонецФункции // СоответствиеМетаданных()

Процедура СтруктВставить( структ, Знач пКлюч, Знач пИмяОбъекта, Знач пТипОбъекта)

	структ.Вставить( пКлюч, Новый Структура("Имя,Тип", пИмяОбъекта, пТипОбъекта ) );

КонецПроцедуры

Функция Запускальщик() Экспорт
	
	Попытка
		
		WshShell = Новый COMОбъект( "WScript.Shell" );
		
	Исключение
		
		WshShell = Неопределено;
		
	КонецПопытки;
	
	Возврат WshShell;
	
КонецФункции

Функция ВКОбщая() Экспорт 
	
	Попытка
		ВК = Новый ("AddIn.ирОбщая.AddIn");
	Исключение
		Это64битныйПроцесс = Это64битныйПроцессЛкс();
		ИмяМакета = "ВК";
		Если Это64битныйПроцесс Тогда
			ИмяМакета = ИмяМакета + "64";
		Иначе
			ИмяМакета = ИмяМакета + "32";
		КонецЕсли; 
		
		ДвоичныеДанные = ПолучитьОбщийМакет(ИмяМакета);
		АдресКомпоненты = ПолучитьИмяВременногоФайла("dll");
		ДвоичныеДанные.Записать(АдресКомпоненты);
		//АдресКомпоненты = "D:\VC\Native_Comp_RDT\binWin32\AddInNative.dll"; // Для отладки
		Результат = ПодключитьВнешнююКомпоненту(АдресКомпоненты, "ирОбщая", ТипВнешнейКомпоненты.Native);
		Если Не Результат Тогда
			ВызватьИсключение "Не удалось подключить внешнюю компоненту Общая"; 
		КонецЕсли; 
		ВК = Новый ("AddIn.ирОбщая.AddIn");
	КонецПопытки; 
	 
	Возврат ВК;
	
КонецФункции

Функция Это64битныйПроцессЛкс() Экспорт
	
	СисИнфо = Новый СистемнаяИнформация;
	Результат = СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	Возврат Результат;

КонецФункции

