
&НаКлиенте
Процедура ВыгрузитьВерсии(Команда)
	ВыгрузитьВерсииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВерсииНаСервере()
	Запрос       = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Хранилища.Ссылка КАК Ссылка,
		|	Хранилища.КоличествоВерсийВыгружаемыхВРегламентномЗадании КАК КоличествоВерсийВыгружаемыхВРегламентномЗадании
		|ИЗ
		|	Справочник.Хранилища КАК Хранилища";
		//|ГДЕ
		//|	НЕ Хранилища.ПометкаУдаления
		//|	И Хранилища.ИспользоватьВРегламентномЗадании
		//|	И НЕ Хранилища.ВыполняетсяПроверкаАПК";
	
	выборка = Запрос.Выполнить().Выбрать();
	Сообщить("Один");
	Пока выборка.Следующий() Цикл
		Сообщить("Один-1");
		//Справочники.Хранилища.ЗагрузитьИзмененияИзУдаленногоРепозитория( выборка.Ссылка );
		//Справочники.Хранилища.ЗагрузитьНовыеВерсии( выборка.Ссылка );
		//Справочники.Хранилища.ВыгрузитьВерсииВЛокальныйРепозиторий( выборка.Ссылка,
		//															выборка.КоличествоВерсийВыгружаемыхВРегламентномЗадании );
		//Справочники.Хранилища.ВыгрузитьВерсииВУдаленныйРепозиторий( выборка.Ссылка );
		
	КонецЦикла;
КонецПроцедуры
