
&Перед("ИсправитьФайлКонфигурации")
Процедура Гит_ИсправитьФайлКонфигурации(ФайлКонфигурации)
	//Удаляем Несовместимые свойства: //BackgroundLocation, BackgroundAudioPlayback, FileExchangeWithPersonalComputer
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлКонфигурации);
	
	ПостроительДОМ = Новый ПостроительDOM;
	ДокДОМ = ПостроительДОМ.Прочитать(ЧтениеXML);
	
	Найденные = ДокДОМ.ПолучитьЭлементыПоИмени("RequiredMobileApplicationPermissions");
	Если Найденные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	УзелМобайл = Найденные[0];
	УзелМобайл.РодительскийУзел.УдалитьДочерний(УзелМобайл);
	
	ЧтениеXML.Закрыть();
	
	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ФайлКонфигурации);
	
	ЗаписьДОМ = Новый ЗаписьDOM;
	ЗаписьДОМ.Записать(ДокДОМ, ЗаписьХМЛ);
	
	ЗаписьХМЛ.Закрыть();
КонецПроцедуры
